#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/tunarider/aws-micro/runs/run-1RwizCgj6Qc9THvk

Waiting for the plan to start...

Terraform v0.14.10
Configuring remote state backend...
Initializing Terraform configuration...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
      + name                   = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "default"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_eip.bastion will be created
  + resource "aws_eip" "bastion" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"        = "bastion"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
      + vpc                  = true
    }

  # aws_instance.bastion will be created
  + resource "aws_instance" "bastion" {
      + ami                          = "ami-09282971cf2faa4c9"
      + arn                          = (known after apply)
      + associate_public_ip_address  = true
      + availability_zone            = "ap-northeast-2a"
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.nano"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "micro-bastion"
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Name"        = "bastion"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
      + tenancy                      = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"        = "micro"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
      + vpc_id   = (known after apply)
    }

  # aws_key_pair.bastion will be created
  + resource "aws_key_pair" "bastion" {
      + arn         = (known after apply)
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + key_name    = "micro-bastion"
      + key_pair_id = (known after apply)
      + public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDmtKiR5IW94hOHJEoXQ18COpBNItlTh/vO1rjA1N2Bp021UjrE5ghZBCOtTXroTcRDdP4v/0qmb1yrJr7Y/VArozE3Cg/PpZalnb286tdWtT0Lff1j23dLS942NlhKaoxbTBXtzc8JC7AkSTuiNty/N41A4l4lQJ7tmXnoKEi8aqUge6JPDpnsHl+e1SSwTGqaspF9HLdWusy2R4apboJ/NoYlV1Mcb8qL12dAhk7mX+DrayuxWiQx8EasKqHyTuMu2znHS8zU/BQbUjKwA1hQTtg435a/io/GiOSVFzsSGuOISyBkyw1Syrzh31o+jSXlU4HlZBiipOhy2mJHFV1HLeJMJdMpNnpHEMNGYXHSgt2edw/nTdeB/ClF5uzw+X3+9ao32zsWAtrjQxNuglCWRKI4c2QGHvYYYeZAuUfUIAFQX0fNHkMzLBYQ7mfZBEGiZncgcZ8mEOsFdEfDrK73X8t5CVldse3GxQtF0eJtYo262C2tXzdYn2uuj9niKIdBd5ujYspfWVluF6HluwPEArWX+S4u1zLqPHEDbgquX/PJiE7wN1Q6Xs99zQFrKc8MEEucyrJJh9YeEdj239ltH7VqUDJQfHkbTZJcS49lVlHpd7EHzQVNQ9KPhk6caYXiwbYSZfcqV8alUNlUW9nJr2NvJTBzR941h8QgWjx0sw== bastion"
      + tags        = {
          + "Name"        = "micro-bastion"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
    }

  # aws_key_pair.default will be created
  + resource "aws_key_pair" "default" {
      + arn         = (known after apply)
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + key_name    = "micro-default"
      + key_pair_id = (known after apply)
      + public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDIz+bhbrKlms0xxQtXN/4velfi/LgQc5uQBc2HmZl8wmoLlvXhQh0AP+21m/vJun0YxNSSjNbTIQuSRSI1g2N+J7F9GjD9SK9fjQ6Mejl1X3/U3xmEByTm00BCPeaBrUtW+2+5mo0dfwY/LvBC+vrfBwS2tc+lc9MzP2u64OJ3tSKpXd8CwsQh2ErD73ncNuT/97YDyNYKZ+GZU15Z8I4OOvQx4yWtLlxh76p3N+1i/xavB3kbhkF6SyY/oNjoLSTkChYUfTF0iJZ6CXhh8G4ARF2c+siQp7MeLNn1c0jXVGgBEdMA38D48xSWymFIuwCkbqMdbmDYWqew1VlJRxIINHh8YGMuaq4kUUcfKCewBRC5CZ9UV7mquds8fQRGGCce20rRyDWgVE0Tvm9wVCGpFtavSFT99cEYKQHXAtySS1ZiOBZzPN8ZCNc9eIVd8rZI3CZUNUs/iQ64ytJq/7iF8A+kpaceeb4ESpOMHSlXOmtGMegl0pUOVdsmIY/orOvkcucIyCmp2nNXjZl4lP4nLh7kTyk6FjpNxVokFLZ2mB5xy7WUBoyqm5ch277sbZjjc78X3WovzmGtqN79UALyLgdHUQCpS3lMPIG0F+VY1kmsRTb7tuOimeowpQ9KhDfNn8x1qffzAuYT89MWSwZV0D5Vt9wzW2z4AVbpfe4NFw== default"
      + tags        = {
          + "Name"        = "micro-default"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
    }

  # aws_network_acl.public will be created
  + resource "aws_network_acl" "public" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = null
              + icmp_type       = null
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = null
              + icmp_type       = null
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name"        = "public"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
      + vpc_id     = (known after apply)
    }

  # aws_resourcegroups_group.main will be created
  + resource "aws_resourcegroups_group" "main" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "micro"
      + tags = {
          + "Name"        = "micro"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }

      + resource_query {
          + query = jsonencode(
                {
                  + ResourceTypeFilters = [
                      + "AWS::AllSupported",
                    ]
                  + TagFilters          = [
                      + {
                          + Key    = "Project"
                          + Values = [
                              + "micro",
                            ]
                        },
                    ]
                }
            )
          + type  = "TAG_FILTERS_1_0"
        }
    }

  # aws_route53_record.bastion will be created
  + resource "aws_route53_record" "bastion" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "bastion.micro.internal"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # aws_route53_zone.private will be created
  + resource "aws_route53_zone" "private" {
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "micro.internal"
      + name_servers  = (known after apply)
      + tags          = {
          + "Name"        = "private"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
      + zone_id       = (known after apply)

      + vpc {
          + vpc_id     = (known after apply)
          + vpc_region = (known after apply)
        }
    }

  # aws_route_table.public_primary will be created
  + resource "aws_route_table" "public_primary" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                = "0.0.0.0/0"
              + egress_only_gateway_id    = ""
              + gateway_id                = (known after apply)
              + instance_id               = ""
              + ipv6_cidr_block           = ""
              + local_gateway_id          = ""
              + nat_gateway_id            = ""
              + network_interface_id      = ""
              + transit_gateway_id        = ""
              + vpc_endpoint_id           = ""
              + vpc_peering_connection_id = ""
            },
        ]
      + tags             = {
          + "Name"        = "public_primary"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public_secondary will be created
  + resource "aws_route_table" "public_secondary" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                = "0.0.0.0/0"
              + egress_only_gateway_id    = ""
              + gateway_id                = (known after apply)
              + instance_id               = ""
              + ipv6_cidr_block           = ""
              + local_gateway_id          = ""
              + nat_gateway_id            = ""
              + network_interface_id      = ""
              + transit_gateway_id        = ""
              + vpc_endpoint_id           = ""
              + vpc_peering_connection_id = ""
            },
        ]
      + tags             = {
          + "Name"        = "public_secondary"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.public_primary will be created
  + resource "aws_route_table_association" "public_primary" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_secondary will be created
  + resource "aws_route_table_association" "public_secondary" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.public_ssh will be created
  + resource "aws_security_group" "public_ssh" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "public_ssh"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "public_ssh"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.public_primary will be created
  + resource "aws_subnet" "public_primary" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-northeast-2a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.0.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"        = "public_primary"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.public_secondary will be created
  + resource "aws_subnet" "public_secondary" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "ap-northeast-2c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "192.168.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"        = "public_secondary"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "192.168.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name"        = "micro"
          + "Project"     = "micro"
          + "Provisioner" = "terraform"
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bastion_public_ip         = (known after apply)
  + default_key_pair_name     = "micro-default"
  + default_security_group_id = (known after apply)
  + project                   = "micro"
  + public_subnet_ids         = [
      + (known after apply),
      + (known after apply),
    ]
  + region                    = "ap-northeast-2"
  + vpc_id                    = (known after apply)
```
</details>
*Pusher: @tunarider, Action: `pull_request`*